//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : © 𝙿𝚁𝙾𝙹𝙴𝙲𝚃 𝙺𝙸𝙽𝙶 𝚂𝙰𝙽𝙳𝙴𝚂𝙷 𝙼𝙳
//  * @version      : 2.0
//  * @author       : Mr Sandesh Bhashana
//  * @tiktok       : https://tiktok.com/@mr__unknown_sandesh
//  * @description  : A Multi-functional WhatsApp bot created by Sandesh Bhashana(Mr Unknown)
//*
//*
//Base by sandesh bhashana
//GitHub: @vijitharanawakage 
//WhatsApp: +94741259325
//Want more free bot scripts?Contact me
//   * Credit Goes To Sandesh Bhashana 
//   * © 2025 King-sandesh-md
// 
// */
// $$\   $$\ $$$$$$\ $$\   $$\  $$$$$$\           $$$$$$\   $$$$$$\  $$\   $$\ $$$$$$$\  $$$$$$$$\  $$$$$$\  $$\   $$\         $$\      $$\ $$$$$$$\                                     
// $$ | $$  |\_$$  _|$$$\  $$ |$$  __$$\         $$  __$$\ $$  __$$\ $$$\  $$ |$$  __$$\ $$  _____|$$  __$$\ $$ |  $$ |        $$$\    $$$ |$$  __$$\                                    
// $$ |$$  /   $$ |  $$$$\ $$ |$$ /  \__|        $$ /  \__|$$ /  $$ |$$$$\ $$ |$$ |  $$ |$$ |      $$ /  \__|$$ |  $$ |        $$$$\  $$$$ |$$ |  $$ |                                   
// $$$$$  /    $$ |  $$ $$\$$ |$$ |$$$$\ $$$$$$\ \$$$$$$\  $$$$$$$$ |$$ $$\$$ |$$ |  $$ |$$$$$\    \$$$$$$\  $$$$$$$$ |$$$$$$\ $$\$$\$$ $$ |$$ |  $$ |                                   
// $$  $$<     $$ |  $$ \$$$$ |$$ |\_$$ |\______| \____$$\ $$  __$$ |$$ \$$$$ |$$ |  $$ |$$  __|    \____$$\ $$  __$$ |\______|$$ \$$$  $$ |$$ |  $$ |                                   
// $$ |\$$\    $$ |  $$ |\$$$ |$$ |  $$ |        $$\   $$ |$$ |  $$ |$$ |\$$$ |$$ |  $$ |$$ |      $$\   $$ |$$ |  $$ |        $$ |\$  /$$ |$$ |  $$ |                                   
// $$ | \$$\ $$$$$$\ $$ | \$$ |\$$$$$$  |        \$$$$$$  |$$ |  $$ |$$ | \$$ |$$$$$$$  |$$$$$$$$\ \$$$$$$  |$$ |  $$ |        $$ | \_/ $$ |$$$$$$$  |                                   
// \__|  \__|\______|\__|  \__| \______/          \______/ \__|  \__|\__|  \__|\_______/ \________| \______/ \__|  \__|        \__|     \__|\_______/                                    
                                                                                                                                                                                      
                                                                                                                                                                                      
                                                                                                                                                                                      
// $$$$$$$\                   $$$$$$\                            $$\                     $$\             $$$$$$$\  $$\                           $$\                                     
// $$  __$$\                 $$  __$$\                           $$ |                    $$ |            $$  __$$\ $$ |                          $$ |                                    
// $$ |  $$ |$$\   $$\       $$ /  \__| $$$$$$\  $$$$$$$\   $$$$$$$ | $$$$$$\   $$$$$$$\ $$$$$$$\        $$ |  $$ |$$$$$$$\   $$$$$$\   $$$$$$$\ $$$$$$$\   $$$$$$\  $$$$$$$\   $$$$$$\  
// $$$$$$$\ |$$ |  $$ |      \$$$$$$\   \____$$\ $$  __$$\ $$  __$$ |$$  __$$\ $$  _____|$$  __$$\       $$$$$$$\ |$$  __$$\  \____$$\ $$  _____|$$  __$$\  \____$$\ $$  __$$\  \____$$\ 
// $$  __$$\ $$ |  $$ |       \____$$\  $$$$$$$ |$$ |  $$ |$$ /  $$ |$$$$$$$$ |\$$$$$$\  $$ |  $$ |      $$  __$$\ $$ |  $$ | $$$$$$$ |\$$$$$$\  $$ |  $$ | $$$$$$$ |$$ |  $$ | $$$$$$$ |
// $$ |  $$ |$$ |  $$ |      $$\   $$ |$$  __$$ |$$ |  $$ |$$ |  $$ |$$   ____| \____$$\ $$ |  $$ |      $$ |  $$ |$$ |  $$ |$$  __$$ | \____$$\ $$ |  $$ |$$  __$$ |$$ |  $$ |$$  __$$ |
// $$$$$$$  |\$$$$$$$ |      \$$$$$$  |\$$$$$$$ |$$ |  $$ |\$$$$$$$ |\$$$$$$$\ $$$$$$$  |$$ |  $$ |      $$$$$$$  |$$ |  $$ |\$$$$$$$ |$$$$$$$  |$$ |  $$ |\$$$$$$$ |$$ |  $$ |\$$$$$$$ |
// \_______/  \____$$ |       \______/  \_______|\__|  \__| \_______| \_______|\_______/ \__|  \__|      \_______/ \__|  \__| \_______|\_______/ \__|  \__| \_______|\__|  \__| \_______|
//           $$\   $$ |                                                                                                                                                                  
//          \$$$$$$  |                                                                                                                                                                  
//            \______/                                                                                                                                                                   
// 
function _0x49ec(_0x32d734,_0x3c4236){const _0x105650=_0x1056();return _0x49ec=function(_0x49ec87,_0x518926){_0x49ec87=_0x49ec87-0x97;let _0x26dd40=_0x105650[_0x49ec87];return _0x26dd40;},_0x49ec(_0x32d734,_0x3c4236);}const _0x2b5786=_0x49ec;(function(_0xce0799,_0x3b4550){const _0x9aa52c=_0x49ec,_0x3472cf=_0xce0799();while(!![]){try{const _0x35751b=parseInt(_0x9aa52c(0xa3))/0x1+-parseInt(_0x9aa52c(0xb5))/0x2*(-parseInt(_0x9aa52c(0xaf))/0x3)+-parseInt(_0x9aa52c(0xab))/0x4+-parseInt(_0x9aa52c(0xa9))/0x5+parseInt(_0x9aa52c(0x9f))/0x6*(-parseInt(_0x9aa52c(0xa7))/0x7)+parseInt(_0x9aa52c(0xa1))/0x8*(parseInt(_0x9aa52c(0xa0))/0x9)+parseInt(_0x9aa52c(0xa8))/0xa;if(_0x35751b===_0x3b4550)break;else _0x3472cf['push'](_0x3472cf['shift']());}catch(_0x578e84){_0x3472cf['push'](_0x3472cf['shift']());}}}(_0x1056,0x47604));const config=require(_0x2b5786(0xb0)),{cmd}=require(_0x2b5786(0x98)),yts=require(_0x2b5786(0xb6));cmd({'pattern':'yt2','alias':[_0x2b5786(0xac),_0x2b5786(0xae)],'react':'🎵','desc':_0x2b5786(0xa6),'category':_0x2b5786(0xb1),'use':'.song\x20<query\x20or\x20url>','filename':__filename},async(_0x3a2be7,_0x544100,_0x11d3be,{from:_0x2ae0df,q:_0x2d90cf,reply:_0x15f9fc})=>{const _0x267e00=_0x2b5786;try{if(!_0x2d90cf)return await _0x15f9fc('❌\x20Please\x20provide\x20a\x20song\x20name\x20or\x20YouTube\x20URL!');let _0x595202,_0x37534a;if(_0x2d90cf['match'](/(youtube\.com|youtu\.be)/)){_0x595202=_0x2d90cf;const _0x557327=await yts({'videoId':_0x2d90cf[_0x267e00(0xa2)](/[=/]/)['pop']()});_0x37534a=_0x557327[_0x267e00(0x97)];}else{const _0x2531af=await yts(_0x2d90cf);if(!_0x2531af['videos'][_0x267e00(0x99)])return await _0x15f9fc(_0x267e00(0xad));_0x595202=_0x2531af[_0x267e00(0x9a)][0x0]['url'],_0x37534a=_0x2531af[_0x267e00(0x9a)][0x0]['title'];}await _0x15f9fc(_0x267e00(0x9d));const _0x1a1660=_0x267e00(0x9c)+encodeURIComponent(_0x595202),_0x51af01=await fetch(_0x1a1660),_0x57784d=await _0x51af01[_0x267e00(0x9e)]();if(!_0x57784d[_0x267e00(0xa5)])return await _0x15f9fc('❌\x20Failed\x20to\x20download\x20audio!');await _0x3a2be7[_0x267e00(0xaa)](_0x2ae0df,{'audio':{'url':_0x57784d[_0x267e00(0x9b)][_0x267e00(0xb3)]},'mimetype':_0x267e00(0xa4),'ptt':![]},{'quoted':_0x11d3be}),await _0x15f9fc('✅\x20*'+_0x37534a+_0x267e00(0xb2));}catch(_0x604331){console[_0x267e00(0xb7)](_0x604331),await _0x15f9fc(_0x267e00(0xb4)+_0x604331['message']);}});function _0x1056(){const _0x1376ad=['json','6lYdjgf','72PoxnTM','37936qLQCMn','split','537027vUPErN','audio/mpeg','success','Download\x20audio\x20from\x20YouTube','625457TxMTng','511460WWlxcH','788650UYBoNr','sendMessage','894788hLQpQM','play2','❌\x20No\x20results\x20found!','music','105xCgdTV','../config','download','*\x20𝐃ᴏᴡɴʟᴏᴀᴅᴇ𝐃\x20𝐒ᴜᴄᴄᴇꜱꜱꜰᴜʟʟ𝐘..!\x0a\x0a>\x20*©\x20Powered\x20By\x20King-Sandesh\x20Md\x20V2\x20💸*','download_url','❌\x20Error:\x20','7830brVUDj','yt-search','error','title','../command','length','videos','result','https://api.davidcyriltech.my.id/download/ytmp3?url=','⏳\x20𝐃ᴏᴡɴʟᴏᴀᴅɪɴɢ\x20𝐘ᴏᴜʀ\x20𝐀ᴜᴅɪᴏ...\x0a\x0a✋\x20𝐏ʟᴇᴀꜱᴇ\x20𝐖ᴀɪᴛ\x20𝐒ɪʀ...'];_0x1056=function(){return _0x1376ad;};return _0x1056();}
